---
kind: other
id: Methods.T:Autodesk.Revit.DB.KeyBasedTreeEntryError
source: html/aadeb171-406f-bc1c-0060-0d1a4785ad52.htm
---
# KeyBasedTreeEntryError Methods

Gets the entry for which an error occurred while building the KeyBasedTreeEntries object.